Autodesk.Navisworks.Api.TextExtents2D
Extents of a 2D text object. Immutable.

Autodesk.Navisworks.Api.TextExtents2D.#ctor
Creates an empty extents object.

Autodesk.Navisworks.Api.TextExtents2D.#ctor(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
Creates a new extents object.

Autodesk.Navisworks.Api.TextExtents2D.Bounds
Bounding box
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.TextExtents2D.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.TextExtents2D.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.TextExtents2D.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.TextExtents2D.Origin
Origin
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.TextExtents2D.ToString
Returns a  that represents the current .
Returns: A  that represents the current .